# ElevReferenceLabelPos Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ElevReferenceLabelPos Property
ParameterTypeId Class See Also
---
"Reference Label Position"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ElevReferenceLabelPos { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElevReferenceLabelPos As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ElevReferenceLabelPos {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace